IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
static uint32_t Camera_SDStorage_SwitchConflictPinsToSdioAf12(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF12))
    {
        return CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchFullSdioGpioToAf12(void)
{
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    /* Mark takeover before verification so cleanup restores partial switches. */
    s_camera_sd_full_gpio_af12_selected = 1U;
    if (Camera_SDStorage_VerifyFullGpioAf12() == 0U)
    {
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveFullSdioGpioToInput(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    s_camera_sd_full_gpio_af12_selected = 0U;
    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U))
    {
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_RestoreConflictPins(void)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF13_DCMI;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF13))
    {
        return CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
    }

    return CAMERA_SD_OK;
}

static void Camera_SDStorage_PrepareSdHandle(void)
{
    s_camera_sd_handle.Instance = SDIO;
    s_camera_sd_handle.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    s_camera_sd_handle.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    s_camera_sd_handle.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    s_camera_sd_handle.Init.BusWide = SDIO_BUS_WIDE_1B;
    s_camera_sd_handle.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    s_camera_sd_handle.Init.ClockDiv = CAMERA_SD_INIT_CLOCK_DIV;
}

static void Camera_SDStorage_EnableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_ENABLE();
    s_camera_sd_clock_enabled = 1U;
}

static void Camera_SDStorage_DisableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_DISABLE();
    s_camera_sd_clock_enabled = 0U;
}

void Camera_SDStorage_InitState(void)
{
    memset(&s_camera_sd_status, 0, sizeof(s_camera_sd_status));
    memset(&s_camera_sd_handle, 0, sizeof(s_camera_sd_handle));
    memset(&s_camera_sd_card_info, 0, sizeof(s_camera_sd_card_info));
    memset(&s_camera_sd_fatfs, 0, sizeof(s_camera_sd_fatfs));

    s_camera_sd_status.supported = 1U;
    s_camera_sd_status.takeover_required = 1U;
    s_camera_sd_status.dvp_mask_available = 1U;
    s_camera_sd_status.dvp_reg_3018_saved =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.dvp_reg_3018_current_or_restored =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_mount_result =
        CAMERA_SD_FATFS_MOUNT_NOT_RUN;
    s_camera_sd_status.last_mount_text = "NOT_RUN";
    s_camera_sd_status.last_sd_init_status = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_sd_init_error = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_sd_rw_status = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_sd_rw_error = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_full_gpio_af12_selected = 0U;
    s_camera_sd_clock_enabled = 0U;
    s_camera_sd_card_info_valid = 0U;
    s_camera_sd_fatfs_session_active = 0U;
    s_camera_sd_fatfs_disk_error = CAMERA_SD_OK;
    Camera_SDStorage_SetLastError(CAMERA_SD_OK);
}

void Camera_SDStorage_GetStatus(CameraSdStorageStatus_t *status)
{
    if (status != NULL)
    {
        *status = s_camera_sd_status;
    }
}

uint32_t Camera_SDStorage_StopDvpConflictPads(void)
{
    uint32_t result = CAMERA_SD_OK;
    uint8_t register_value = 0U;
    uint8_t masked_value;

    if (Camera_SnapshotControl_IsTakeoverPreconditionReady() == 0U)
    {
        result = CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }
    else if (SCCB_ReadReg(
                 CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG,
                 &register_value) != 0U)
    {
        result = CAMERA_SD_ERR_SENSOR_REG_READ_FAILED;
    }
    else
    {
        if (s_camera_sd_status.dvp_mask_active == 0U)
        {
            s_camera_sd_status.dvp_reg_3018_saved = register_value;
        }
        s_camera_sd_status.dvp_reg_3018_current_or_restored = register_value;

        masked_value = (uint8_t)(
            register_value & CAMERA_SD_DVP_CONFLICT_PAD_KEEP_MASK);
        if (SCCB_WriteReg(
                CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG,
                masked_value) != 0U)
        {
            result = CAMERA_SD_ERR_SENSOR_REG_WRITE_FAILED;
        }
        else
        {
            HAL_Delay(5U);
            if (SCCB_ReadReg(
                    CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG,
                    &register_value) != 0U)
            {
                result = CAMERA_SD_ERR_SENSOR_REG_READ_FAILED;
            }
            else
            {
                s_camera_sd_status.dvp_reg_3018_current_or_restored =
                    register_value;
                if (register_value != masked_value)
                {
                    result = CAMERA_SD_ERR_SENSOR_REG_VERIFY_FAILED;
                }
            }
        }
    }

