IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
uint32_t Camera_SDStorage_FatFsDiskIoctl(uint8_t command, void *buffer)
{
    uint32_t result = CAMERA_SD_OK;

    if ((s_camera_sd_fatfs_session_active == 0U) ||
        (s_camera_sd_status.sdio_ready == 0U) ||
        (s_camera_sd_card_info_valid == 0U))
    {
        result = CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }
    else if (command == CTRL_SYNC)
    {
        result = Camera_SDStorage_WaitForCardTransfer();
    }
    else if (buffer == NULL)
    {
        result = CAMERA_SD_ERR_INVALID_ARGUMENT;
    }
    else
    {
        switch (command)
        {
            case GET_SECTOR_COUNT:
                *((uint32_t *)buffer) = s_camera_sd_card_info.LogBlockNbr;
                break;

            case GET_SECTOR_SIZE:
                *((uint16_t *)buffer) =
                    (uint16_t)s_camera_sd_card_info.LogBlockSize;
                break;

            case GET_BLOCK_SIZE:
                *((uint32_t *)buffer) = 1U;
                break;

            default:
                result = CAMERA_SD_ERR_FATFS_DISK_IOCTL_FAILED;
                break;
        }
    }

    if (result != CAMERA_SD_OK)
    {
        s_camera_sd_fatfs_disk_error = result;
    }
    return result;
}

uint32_t Camera_SDStorage_CheckFatfsMount(void)
{
    uint32_t result = CAMERA_SD_OK;
    uint32_t step_result;
    uint32_t prepare_attempted = 0U;
    uint32_t dvp_restore_required = 0U;
    uint32_t takeover_attempted = 0U;
    uint32_t mount_attempted = 0U;
    uint32_t restore_continuous_capture;
    FRESULT mount_result;

    s_camera_sd_status.card_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;
    s_camera_sd_status.last_mount_result =
        CAMERA_SD_FATFS_MOUNT_NOT_RUN;
    s_camera_sd_status.last_mount_text = "NOT_RUN";
    s_camera_sd_fatfs_disk_error = CAMERA_SD_OK;

    if ((Camera_SnapshotControl_IsSoftwareGuardActive() != 0U) ||
        (s_camera_sd_fatfs_session_active != 0U) ||
        (s_camera_sd_full_gpio_af12_selected != 0U) ||
        (s_camera_sd_clock_enabled != 0U) ||
        (s_camera_sd_status.dvp_mask_active != 0U))
    {
        result = CAMERA_SD_ERR_SNAPSHOT_BUSY;
        Camera_SDStorage_SetLastError(result);
        return result;
    }

    s_camera_sd_status.dvp_reg_3018_saved =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    restore_continuous_capture =
        ((DCMI->CR & DCMI_CR_CAPTURE) != 0U) ? 1U : 0U;
    Camera_SDStorage_EnsureDcmiDmaHandle();
    prepare_attempted = 1U;
    step_result = Camera_SnapshotControl_RequestPrepare();
    if (step_result != CAMERA_SNAPSHOT_OK)
    {
        result = CAMERA_SD_ERR_SNAPSHOT_PREPARE_FAILED;
        goto cleanup;
    }

    step_result = Camera_SDStorage_StopDvpConflictPads();
    if (s_camera_sd_status.dvp_reg_3018_saved !=
        CAMERA_SD_REG_VALUE_UNKNOWN)
    {
        dvp_restore_required = 1U;
    }
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    takeover_attempted = 1U;
    step_result = Camera_SDStorage_RequestTakeoverEnter();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    step_result = Camera_SDStorage_RequestInit();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    s_camera_sd_fatfs_session_active = 1U;
    mount_attempted = 1U;
    mount_result = f_mount(&s_camera_sd_fatfs, "", 1U);
    Camera_SDStorage_SetMountResult(mount_result);
    if (mount_result != FR_OK)
    {
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_MOUNT_FAILED;
        goto cleanup;
    }

    s_camera_sd_status.fatfs_ready = 1U;

cleanup:
    if (mount_attempted != 0U)
    {
        mount_result = f_mount(NULL, "", 0U);
        if (mount_result != FR_OK)
        {
            Camera_SDStorage_RecordFirstError(
                &result,
                CAMERA_SD_ERR_FATFS_UNMOUNT_FAILED);
        }
        s_camera_sd_status.fatfs_ready = 0U;
    }
    s_camera_sd_fatfs_session_active = 0U;

    if (takeover_attempted != 0U)
    {
        step_result = Camera_SDStorage_RequestTakeoverExit();
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    if (dvp_restore_required != 0U)
    {
        step_result = Camera_SDStorage_RestoreDvpConflictPads();
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    if (prepare_attempted != 0U)
    {
        (void)Camera_SnapshotControl_RequestRestore();
        if (restore_continuous_capture != 0U)
        {
            Camera_DCMI_StartToLCD(
                0U,
                0U,
                CAMERA_SD_RESTORE_LCD_WIDTH,
                CAMERA_SD_RESTORE_LCD_HEIGHT);
        }
    }

    s_camera_sd_status.card_ready =
        (result == CAMERA_SD_OK) ? 1U : 0U;
    Camera_SDStorage_SetLastError(result);
    return result;
}

const char *Camera_SDStorage_ErrorToString(uint32_t error_code)
{
    switch (error_code)
    {
        case CAMERA_SD_OK:
            return "OK";
        case CAMERA_SD_ERR_NOT_IMPLEMENTED:
            return "NOT_IMPLEMENTED";
        case CAMERA_SD_ERR_NEED_TAKEOVER:
            return "NEED_TAKEOVER";
        case CAMERA_SD_ERR_TAKEOVER_ALREADY_ACTIVE:
            return "TAKEOVER_ALREADY_ACTIVE";
        case CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED:
            return "SNAPSHOT_NOT_PAUSED";
        case CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED:
            return "CONFLICT_PIN_RELEASE_FAILED";
        case CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED:
            return "CONFLICT_PIN_RESTORE_FAILED";
        case CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED:
            return "SDIO_AF12_SWITCH_FAILED";
        case CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED:
            return "SDIO_AF12_RESTORE_FAILED";
        case CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED:
            return "SDIO_FULL_GPIO_SWITCH_FAILED";
        case CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED:
            return "SDIO_FULL_GPIO_RESTORE_FAILED";
        case CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED:
            return "SDIO_HAL_INIT_FAILED";
        case CAMERA_SD_ERR_SDIO_HAL_DEINIT_FAILED:
            return "SDIO_HAL_DEINIT_FAILED";
        case CAMERA_SD_ERR_CARD_INFO_FAILED:
            return "CARD_INFO_FAILED";
        case CAMERA_SD_ERR_SENSOR_REG_READ_FAILED:
            return "SENSOR_REG_READ_FAILED";
        case CAMERA_SD_ERR_SENSOR_REG_WRITE_FAILED:
            return "SENSOR_REG_WRITE_FAILED";
        case CAMERA_SD_ERR_SENSOR_REG_VERIFY_FAILED:
            return "SENSOR_REG_VERIFY_FAILED";
        case CAMERA_SD_ERR_NO_SAVED_3018:
            return "NO_SAVED_3018";
        case CAMERA_SD_ERR_SNAPSHOT_BUSY:
            return "SNAPSHOT_BUSY";
        case CAMERA_SD_ERR_SNAPSHOT_PREPARE_FAILED:
            return "SNAPSHOT_PREPARE_FAILED";
        case CAMERA_SD_ERR_FATFS_MOUNT_FAILED:
            return "FATFS_MOUNT_FAILED";
        case CAMERA_SD_ERR_FATFS_UNMOUNT_FAILED:
            return "FATFS_UNMOUNT_FAILED";
        case CAMERA_SD_ERR_FATFS_DISK_NOT_READY:
            return "FATFS_DISK_NOT_READY";
        case CAMERA_SD_ERR_FATFS_DISK_READ_FAILED:
            return "FATFS_DISK_READ_FAILED";
        case CAMERA_SD_ERR_FATFS_DISK_IOCTL_FAILED:
            return "FATFS_DISK_IOCTL_FAILED";
        case CAMERA_SD_ERR_FATFS_CARD_TIMEOUT:
            return "FATFS_CARD_TIMEOUT";
        case CAMERA_SD_ERR_INVALID_ARGUMENT:
            return "INVALID_ARGUMENT";
        default:
            return "UNKNOWN_ERROR";
    }
}
